Revit 2027 API
BuiltInFailures.RenderFailures Class
 Failures related to rendering.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RenderFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RenderFailures
Public NotInheritable Class RenderFailures
public ref class RenderFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RenderFailures = class end
The BuiltInFailures.RenderFailures type exposes the following members.
Properties
Name | Description
LightParametersNotInRange |  The value should be in range of [Value] and [Value].
LightSourceInsideGeometry |  Light source is inside solid geometry. No light will be emitted during rendering.
ProhibitDeletionLightSource |  The light source cannot be deleted with UI.
RenderLibNotInstalledWarn |  Rendering library has not been installed, so the third party geometry cannot be created.
Top
See Also
Reference
Autodesk.Revit.DB Namespace